file_path = "data/2017-pixnet-hackathon-data.tar.gz"
topic_file_name = 'constellation.json'
relist=["\n"," " , "." , "，",",","！","!","、","：","。",'~',"也","了","人","在","不","你","好",\
"對","就","很","是","會","有","的","自己","要","讓","都","一個","但","到","上","去","可能","可以","和","因為","多","如果","就是","或",\
"所以","把","星座","更","沒有","為","而","與","被","覺得","跟","1","3","一些","不是","不會","中","事情","什麼","他","他們","但是","來",\
"又","對方","很多","得","想","感覺","新","時候","最","比較","能","著","這","這個","這樣","還是","開始","需要","非常","/","2","「","」","？",\
"(",")","/","12","4","5","【","】","一","（","）"]

word_=['麵包','摩羯']


clever=["水瓶","水瓶座"]
romantic=["雙魚","雙魚座"]
generous=["牡羊","牡羊座"]
reliable=["金牛","金牛座"]
witty=["雙子","雙子座"]
frugal=["巨蟹","巨蟹座"]
lion=["獅子","獅子座"]
tidy=["處女","處女座"]
diplomatic=["天秤","天秤座"]
passionate=["天蠍","天蠍座"]
optimistic=["射手","人馬","射手座","人馬座"]
calm=["摩羯","摩羯座"]
constellationlist=clever+romantic+generous+reliable+witty+frugal+lion+tidy+diplomatic+passionate+optimistic+calm

